{
  "tempdetails": [
    {
      "id": 0,
      "templeName": "Nataraja Temple",
      "location": "CHIDAMBARAM",
      "thumbnailPath": "images/Chidambaram01.jpg",
      "MainImagepath": "images/CHIDAMBARAM.jpg",
      "nearestBusStop": "Chidambaram Central Bus Stop",
      "nearestRailwayStation": "Chidambaram Railway Station",
      "nearestAirport": "Tiruchirapalli Airport",
      "description": "At a distance of 217 km from Chennai, 189 km from Kanchipuram, 43 km Cuddalore, 66 km from Pondicherry, 43 km Mayiladuthurai, 85 km from Nagapattinam, 303 km from Madurai and 173 km from Trichy, Chidambaram is a pilgrimage town in Cuddalore district in the state of Tamil Nadu. Well known for Nataraja Temple, Chidambaram is one of the most ancient and most celebrated shrines in South India. Chidambaram is also known as Thillai. The name Chidambaram comes from the Tamil word Chitrambalam which means the small hall or stage of wisdom. According to legend, it was once a forest of thillai, a mangrove species of trees. There was once a small shrine on the banks of a tank. The saints Vyagrapada and Patanjali are said to have worshipped at this shrine, now called Thirumoolanathar. It is believed that their penance attained perfection with the revelation of Shiva's cosmic dance by Lord Nataraja on the auspicious Thai Poosam day. The town of Chidambaram has been ruled by many kingdoms over the centuries, most notably the Medieval Cholas, Later Cholas, Pandyas, Vijaynagar Kingdom, the Marathas, and the British. The town is known for the Thillai Nataraja Temple and the annual chariot festival held in the month of April. The Nataraja Temple built during the 11th century is one of the most celebrated Shaivite Temples in South India. Lord Nataraja is the family deity of Vikrama Chola (1128 CE) and his successors. The golden hall of dance was built and covered with gold plates by Jatavarman Sundra Pandya. Chidambaram has great religious as well as historic and cultural significance. This is one of the Panchabhoota Stalas signifying the five elements of wind (Kalahasti), water (Tiruvanaikka), fire (Tiruvannamalai), earth (Kanchipuram) and space (Chidambaram). Lord Vishnu as Lord Govindaraja Perumal is worshipped in the same temple complex. Thillai Kaali Amman Temple, Pichavaram, Sattanathar Temple, Bhuvanagiri, Parangipettai, Annamalai University, Kollidam (river) and Poompuhar are the other attractions in and around Chidambaram. Brahmotsavam, Ani Thirumanjanam, Thai Poosam and Arudra Dharshan are some of the temple festivals that attract large crowds from far and nearby places. Natyanjali Dance Festival is a major festival held in the month of February. Many eminent dancers give their performances during this festival. The nearest airport to Chidambaram is at Chennai, about 212 km away. Chidambaram is located on the Madras-Trichy main line of the Southern Railway. It is connected with Trichy, Chennai, Madurai, Rameshwaram, Bangalore, Villupuram, Mayiladuturai, Thanjavur and Tirupati. Chidambaram is well connected by bus with Chennai, Trichy, Rameshwaram, Pondicherry, Madurai, Bangalore and Villupuram. Best time to visit Chidambaram is July & October to March while the peak season is July & December to February. Usually it takes two full days to visit Chidambaram."
    },
    {
      "templeName": "Kamakshi Amman Temple",
      "location": "KANCHIPURAM",
      "nearestBusStop": "Kanchipuram Central Bus Station",
      "nearestRailwayStation": "Kanchipuram Railway Station",
      "nearestAirport": "Chennai - Menmbarkam Airport (75 Kms)",
      "thumbnailPath": "images/Kanchipuram02.jpg",
      "MainImagepath": "images/KANCHIPURAM.jpg",
      "description": "At a distance of 75 km from Chennai, 68 km from Vellore, 65 km from Mahabalipuram, 108 km from Tirupati & 127 km from Pondicherry, Kanchipuram or Kanchi is one of the most famous pilgrimage sites in South India. It is a temple town and the headquarters of Kanchipuram district. Kanchipuram is one of the most popular weekend getaways from Chennai and one of the major pilgrimage sites in Tamilnadu. Kanchipuram has rich history and it's one of the oldest cities in India. The temples of Kanchipuram are known for their grandeur and great architecture. The architecture of Kanchi monuments were trendsetting with great sculpture work and unique style and became a benchmark for South Indian architecture. The city served as the capital of Pallava Dynasty, and most of the known temples were built during their reign. From the 3rd to the 9th century CE, Kanchi was the capital of the Pallavas who ruled over the territory extending from the river Krishna in Andhra Pradesh to the river Kaveri in the south. The Pallavas fortified the city with ramparts, moats, etc., with wide and well laid out roads and fine temples. They were a great maritime power with contacts with far-off China, Siam, Fiji, etc., through their chief Port Mamallapuram, the modern Mahabalipuram. The Cholas ruled this town from 10th century to 13th century after the fall of Pallavas. Kanchi came under the control of Vijayanagara kingdom from 14th century to 17th century and controlled by British from the end of 18th century. Kanchipuram is located on the Palar River and known for its temples and silk sarees which are woven manually. There are several big temples, like Kamakshi Amman Temple, Varadharaja Perumal Temple, Kailasanathar Temple, Karchapeshwarar Temple, Ekambaranatha Temple which is one of the five forms of abodes of Lord Siva, (it is the earth abode here, other abodes include Chidambaram (Sky), Sri Kalahasti (air), Thiruvanaikoil (water) and Tiruvannamalai (fire)). Kanchipuram is well connected by train and bus from major cities in South. There are frequent buses to Kanchipuram from Chennai, Vellore, Tirupati, Bangalore, Coimbatore, Madurai, Trichy, etc. It usually takes about 2 full days to visit the major sites in Kanchi.",
      "id": "1"
    },
    {
      "id": 2,
      "templeName": "Kumari Amman Temple",
      "location": "KANYAKUMARI",
      "thumbnailPath": "images/Kanyakumari03.jpg",
      "MainImagepath": "images/KANYAKUMARI.jpg",
      "nearestBusStop": "Kanyakumari Bus Station",
      "nearestRailwayStation": "Kanyakumari Railway Station",
      "nearestAirport": "Trivandrum International Airport (85 Kms)",
      "description": "At a distance of 707 km from Chennai, 85 km from Trivandrum, 22 km from Nagercoil, 242 km from Madurai, 375 km from Trichy, 82 km from Tirunelveli and 130 km from Tuticorin, Kanyakumari is a coastal town in Tamil Nadu and a famous pilgrimage and tourist place. Located at the southernmost tip of the Indian Peninsula, it is also called Cape Comorin. Kanyakumari has been a great centre for art and religion for centuries. It was also an area of great trade and commerce. It was ruled by Cholas, Pandyas and Nayaks. Later on, Kanyakumari came under the rule of the Venad dynasty and its capital was located at Padmanabhapuram. In spite of the troubles encountered in the southern border of Venad, Marthanda Varma expanded the kingdom northwards to Aluva and established the kingdom of Travancore. In 1745, the capital was shifted from Padmanabhapuram to Thiruvananthapuram. Kanyakumari was ruled by the kings of Travancore, under the authority of the British, till India's independence in 1947, after that it became a part of the independent Indian Union. This is a popular tourist place and a place of great natural beauty. The city gets its name from the Hindu goddess Kanyakumari who was also known as Kumari Amman. Swami Vivekananda is said to have been lived here for a while and meditated. It is situated at the confluence of Bay of Bengal, Arabian Sea and Indian Ocean. This place offers marvelous Sunset and Sunrise views. It is the only place in India where one can enjoy the unique spectacle of Sunset and Moonrise simultaneously on full moon days. Kanyakumari is held in high regards by the Hindus owing to its scared temples. One of the main attractions in Kanyakumari is the Kumari Amman Temple. Considered as one of the Shakti Peethas, this temple attracts large number of devotees every year. The Vivekananda Rock Memorial, Gandhi Memorial, Thiruvalluvar Statue, Padmanabhapuram Palace, Suchindram, Pechiparai Reservoir, Vattakottai Fort, St Xavier's Church and Udayagiri Fort are the places to see in Kanyakumari. Some of the popular beaches near Kanyakumari are Thengapattinam Beach, Sanguthurai Beach and Chothavilai Beach. Trivandrum Airport is the nearest airport, which is about 97 km from Kanyakumari. Kanyakumari is also connected by rail with cities like Chennai, Bangalore, Mumbai and Jammu. It has good bus connectivity with Trivandrum, Madurai, Trichy, Tirunelveli, Pondicherry, Kochi, Chennai, Bangalore and Tirunelveli. The Chaitra Poornima Festival, Navratri, and the Holy Annual Festival of the Catholic Church are some of the major festivals celebrated in Kanyakumari. Kathakali is the most popular traditional dance form in this region. Best time to visit Kanyakumari is from October to March while the peak season is from November to February. Usually it takes one full day to visit Kanyakumari."
    },
    {
      "id": 3,
      "templeName": "Meenakshi Amman Temple",
      "location": "MADURAI",
      "thumbnailPath": "images/Madurai04.jpg",
      "MainImagepath": "images/MADURAI.jpg",
      "nearestBusStop": "Mattuthavani Bus Terminus (8 Kms)",
      "nearestRailwayStation": "Madurai Junction Railway Station",
      "nearestAirport": "Madurai Airport (10 Kms)",
      "description": "At a distance of 464 km from Chennai, 136 km from Trichy, 169 km from Thanjavur, 170 km from Rameswaram, 114 km from Kodaikanal & 209 km from Coimbatore, Madurai is the third largest city in Tamilnadu and one of the most famous centers of pilgrimage in India and also the prime site of heritage in Tamilnadu. The city is very well known for Madurai Meenakshi Temple. Situated on the banks of the River Vaigai, Madurai is also referred to as Athens of the East and Temple Town. Madhurai is the oldest continually inhabited city in the Indian peninsula, with a history dating all the way back to the Sangam period of the pre-Christian era. It has been inhabited since at least the 3rd century BCE. It is considered as the cultural capital of Tamilnadu. Madurai was the seat of power of the Pandyan Empire. It was built by the Pandyan king Kulasekhara and was the capital city of the great Pandya kings of South India. It was later ruled by Cholas, Later Pandyas, Madurai Sultanate, Vijayanagara, Madurai Nayaks and finally British. Pandyas and Nayaks contributed enormously to the development of Meenakshi Temple and Madurai city. Meenakshi Amman Temple (known as Madhura Meenakshi) is the biggest landmark of Madurai. It is one of the largest temples in India. The temple has a stunning architecture and a significant testimony for Vishwakarma Brahmins for their master architecture in sculpting this temple. The core city of Madurai is built parallel to the streets of Meenakshi Temple. Along with Meenakshi Temple, Thirumalai Nayak Mahal & Koodal Alagar Temple are other important places to visit in Madurai. Madurai is also a base station to visit Trichy, Thanjavur, Rameswaram and Kodaikanal. The Sangam period poet Nakkeerar is associated with some of the Tiruvilayaadal episodes of Sundareswarar - that are enacted as a part of temple festival traditions even today. Madurai has several bus stations. Most of the long distance buses and inter-state buses start from Mattuthavani Bus Terminus (8 km from Railway Station). Buses to Chennai, Bangalore, Trichy, Rameswaram, Thanjavur, Tirupathi, etc start from here. Arappalayam Bus Station is another major bus station (3 km from Railway Station) with connectivity to Kodaikanal, Palani, Theni, Dundigal, etc. Periyar bus station near Railway station is the hub for local city buses."
    },
    {
      "id": 4,
      "templeName": "Sri Ramanathaswamy Temple",
      "location": "RAMESHWARAM",
      "thumbnailPath": "images/Rameshwaram05.jpg",
      "MainImagepath": "images/RAMESHWARAM.jpg",
      "nearestBusStop": "Rameswaram Central Bus Station (3 Kms)",
      "nearestRailwayStation": "Rameswaram Railway Station",
      "nearestAirport": "Madurai Airport (174 Kms)",
      "description": "At a distance of 562 km from Chennai, 227 km from Tirunelveli, 311 km Kanyakumari, 387 km from Pondicherry, 230 km from Trichy, 171 km from Madurai, 371 km from Trivandrum and 607 km from Bangalore, Rameshwaram is one of the most famous Pilgrimage centers in South India & also a Jyotirlinga, situated in Ramanathapuram district of Tamil Nadu. Rameshwaram Temple is one of the most famous Shiva shrines in India. It is significant for Hindus as a pilgrimage to Banaras is incomplete without a Pilgrimage to Rameswaram. According to the legend, Rameswaram is the place from where Lord Rama, built a bridge across the sea to rescue his consort Sita from Ravana. This is also the place where Rama worshipped Lord Shiva to cleanse away the sin of killing Ravana. Both the Vaishnavites and Shaivites visit this pilgrimage which is known as the Varanasi of South. Rameswaram along with Dwarka, Puri and Badrinath form the four Char Dhams. Sri Ramanathaswamy Temple, Agnitheertham, Gandamadana Parvatham, Dhanushkodi, Kothandaraswamy Temple and Erwadi are the popular and the most visited pilgrimage attractions of Rameshwaram. Sri Ramanathaswamy temple (Rameswaram Temple) is one of the most fascinating temples in entire India. This is renowned for its magnificent corridors and massive sculptured pillars. The third corridor of Ramanathaswamy temple is the longest one in the world. The presiding deity here is in the form of a Linga with the name Sri Ramanathaswamy, it also happens to be one of the 12 Jyotirlingas. This temple stands as an epitome of Dravidian architectural style of the medieval ages. There are about 64 thirthas situated in Rameshwaram, of which, 24 are considered as important. Bathing in these Tirthas is a major aspect of the pilgrimage to Rameswaram and is considered equivalent to penance. Twenty-two of the Tirthas are within the Ramanathasvami Temple. Ramanathapuram, Tirupullani, Uthirakosamangai, Sethu are the nearby attractions to Island of Rameshwaram. Beautiful beaches at Olaikuda, Danushkodi and Pamban are other attractions apart from the religious point of view. Scuba diving and Migratory birds watching during winter are the activities here. Rameshwaram is located on the Pamban Island, which lies at the very tip of the Indian peninsula in the Gulf of Mannar. Pamban Island, which is separated from the mainland of India by the Pamban Channel, is connected by the Pamban Bridge or Annai Indira Gandhi Bridge. The nearest airport to Rameshwaram is at Madurai, which is located at a distance of 176 km. Rameshwaram Railway Station is well connected by rail to major cities of Tamil Nadu like Chennai, Madurai, Coimbatore, Thanjavur and Trichy. Rameshwaram is well connected by bus with Chennai, Bangalore, Coimbatore, Kanyakumari, Madurai, Pondicherry, Trichy and Thanjavur. The best time to visit Rameshwaram is July to August & November to March while the peak season is July to August & February to March. Usually it takes 1-2 days to visit Rameshwaram."
    },
    {
      "id": 5,
      "templeName": "Sri Brihadeeswarar Temple",
      "location": "THANJAVUR",
      "thumbnailPath": "images/Thanjavur06.jpg",
      "MainImagepath": "images/THANJAVUR.jpg",
      "nearestBusStop": "Thanjavur New Bus Station (5 Kms)",
      "nearestRailwayStation": "Thanjavur Junction Railway Station",
      "nearestAirport": "Tiruchirapalli Airport (55 Kms)",
      "description": "At a distance of 56 km from Trichy, 112 km from Chidambaram, 86 km from Nagapattinam, 170 km from Madurai, 326 km from Chennai, Thanjavur, also known as Tanjore, is a city and district headquarters in the state of Tamil Nadu. Thanjavur is famous for the Brihadeeswarar Temple built by Rajaraja Chola in the year 1010 AD. Also known as the Big Temple, it is one of UNESCO World Heritage Sites and among most important heritage sites in India. Situated on the banks of River Cauvery, Thanjavur has a rich historical heritage and is a prism of ancient as well as the modern south Indian civilizations. The city was once the stronghold of the historic Cholas and at one time was also the capital of the Cholas, Mutharayars and Marathas when they were at the peak of their power. Since then, Thanjavur has been one of the chief political, cultural and religious centers of South India. Thanjavur became the most important city in the Chola Empire and remained its capital till the emergence of Gangaikonda Cholapuram in about 1025. During the first decade of the eleventh century, the Chola king Raja Raja Chola I (985-1014) constructed the Brihadeeswarar Temple. The temple is considered to be one of the best specimens of South Indian temple architecture. Thanjavur is one of the older cities in Tamil Nadu and has a lot of significance in Dravidian history. Thanjavur was eventually annexed along with the rest of the Chola kingdom by the Pandya king Maravarman Kulasekara Pandyan I in 1279. Later it went into the hands of Delhi Sultanate from whom Vijayanagara rulers have conquered. It was governed by Thanjavur Nayaks under Vijayanagara suzerainty. Thanjavur was successfully conquered by Ekoji I in 1674, the Maratha feudatory of the Nawab of Bijapur and half-brother of Shivaji. Ekoji founded the Thanjavur Maratha kingdom which ruled Thanjavur till 1855. The kingdom was eventually absorbed into British India in 1855 by the Doctrine of Lapse when Shivaji II (1832-55), the last Thanjavur Maratha ruler, died without a male heir. Apart from Brihadeeswarar Temple, Thanjavur and the surrounding areas have several important tourist attractions like Thanjavur Palace, Kumbakonam, Darasuram, Gangaikonda Cholapuram, Thiruvaiyaru, Thirubuvanam, etc. It usually takes a full day to visit the places within Thanjavur town. Thanjavur is also famous for metal sculptures moulded with great facial expressions and beautiful finish."
    },
    {
      "id": 6,
      "templeName": "Sri Kasiviswanathar Temple",
      "location": "TENKASI",
      "thumbnailPath": "images/Tenkasi07.jpg",
      "MainImagepath": "images/TENKASI.jpg",
      "nearestBusStop": "Tenkasi Bus Station (1 Kms)",
      "nearestRailwayStation": "Tenkasi Junction Railway Station",
      "nearestAirport": "Trivandrum International Airport (113 Kms)",
      "description": "At a distance of 56 km from Tirunelveli, 109 km from Trivandrum, 160 km from Madurai, 100 km from Kollam, 132 km from Kanyakumari & 625 km from Chennai, Tenkasi is a popular tourist destination situated on Madurai - Kollam highway. Tenkasi is famous for numerous waterfalls spread around the region including the famous Courtallam Falls. It is the second largest town in Tirunelveli district surrounded by the Western Ghats on three sides. A river called Chittar flows through the town. Tenkasi was founded by Pandyan kings who ruled Southern Tamil Nadu for long time. The Word Tenkasi means Kasi of the South referring to Kasiviswanathar temple situated in the town. The temple was built by Parakrama Pandyan, but was shattered by lightning. In the 1990s, the temple was restored and it was given a fresh coat of paint again in 2006. The main deity here is Kasi Viswanathar (Lord Shiva). Tenkasi has another magnificent Kulasekaranathar Temple, which has been closed for longtime. There is also a temple pond in middle of the town, adjoining the Kannimaramman Temple. Anggalap Parameshwari Temple is in Malayan Street and it is famous for 10 days festival, with Sivarathiri and Alaghu. Esakki Amman Kovil is also located in Malayan street. Tenkasi has train connectivity with Chennai, Madurai, Tiruneveli & Sengottai. It has good bus connectivity from Madurai, Tiruneveli, Kollam, Kanyakumari, etc, Every year July to October tourists can enjoy the waterfalls season and it is also the best season to visit this place. Pongal, Ganesh Chaturthi, Tamil New Year, Maha Shivaratri are the famous festivals celebrated in Tenkasi. It usually takes one full day to explore the major attraction around Tenkasi."
    },
    {
      "id": 7,
      "templeName": "Mayuranatha Swamy Temple",
      "location": "MAYILADUTHURAI",
      "thumbnailPath": "images/Mayiladuthurai08.jpg",
      "MainImagepath": "images/MAYILADUTHURAI.jpg",
      "nearestBusStop": "Mayiladuthurai Bus Station (1 Kms)",
      "nearestRailwayStation": "Mayiladuthurai Junction Railway Station",
      "nearestAirport": "Tiruchirapalli Airport (37 Kms)",
      "description": "At a distance of 37 km from Kumbakonam, 37 km from Karaikal and 42 km from Chidambaram, Mayiladuthurai is a town and headquarters of the Mayiladuthurai Taluk in Nagapattinam district of Tamil Nadu. Mayiladuthurai is known for the Mayuranatha Swamy Temple dedicated to Lord Shiva. This temple is one among the six temples which are compared as equivalent to the temple in Varanasi. The other 5 Shivasthalams are Tiruvenkaadu, Chaayaavanam, Tiruvaiyaru, Tiruvanchiam and Tiruvidaimarudur. This temple was reconstructed with stone in 10th century during the period of Sembiyan Mahadevi. However, the renovations from the 19th century have destroyed some of the older structures and the inscriptions. Some of the stone sculptures of Vinayakar, Natarajar, Dakshimamurthy, Lingodbhavar, Brahma, Ganga Visarjanamurthi, Durga and Bhikshatanar from the period of Sembiyan Mahadevi have been well preserved. The main diety is in the form of lingam called Mayuranathar and his consort Abhayambika appears as a peacock worshipping the Lord here. According to legend, Daksha, father of goddess Parvathi, conducted a Yagna but intentionally didn't invite Lord Shiva to humiliate him. Lord Shiva did not want Parvathi also to attend the Yagna. But Goddess Parvathi attended the function and was humiliated by Daksha. Lord Shiva in Veerabadra form and destroyed the Yagna. As Parvathi ignored Lord's advice, she was cursed to become a peacock. She came to this place as a peacock and performed severe penance for Lord Shiva. Lord Shiva appeared before her as a Peacock himself and danced Mayura Thandavam. Ambica got back to her original form. As Lord came here as a Mayura, he is praised as Mayuranathar. This temple is spread over 8 acres with 5 enclosures, a 165 feet tall Raja Gopura, pillared halls and 14 vimanas (sikharas). The temple is managed by the Tiruvavaduturai Mutt. Lord Muruga in the prakara is praised by saint Arunagiriar in his Tirupugazh hymns. There is a separate shrine for Lord Nataraja. The first puja in the evening is dedicated to Lord Nataraja. Mayilamman shrine is opposite to Nataraja shrine where both Lord and Mother grace in the form of peacock. Two peacocks and two monkeys are depicted in the banyan tree above the Lord Dakshinamurthy sculpture on outer walls of the temple. There is a large temple tank in the centre of the complex. People visit this temple in large numbers on the new moon day in the Tamil month of Aipasi and take bath in the tank. It is believed that this bath purifies a person of sins. Vaikasi Brahmotsavams in May-June, Aipasi Thula Snanam in October-November and Laksha Deepam on the last Friday of Aadi month (July-August) are the festivals celebrated in the temple. An annual dance festival called the Mayura Natyanjali festival is celebrated within the premises of the temple."
    },
    {
      "id": 8,
      "templeName": "Arunachala Temple",
      "location": "TIRUVANNAMALAI",
      "thumbnailPath": "images/Arunachala09.jpg",
      "MainImagepath": "images/TIRUVANNAMALAI.jpg",
      "nearestBusStop": "Thiruvannaamalai Bus Station (1 Kms)",
      "nearestRailwayStation": "Thiruvannaamalai Junction Railway Station",
      "nearestAirport": "Chennai - Menmbarkam Airport (195 Kms)",
      "description": "At a distance of 120 Kms from Kanchipuram, 195 Kms from Chennai, 204 Kms from Bangalore and 83 Kms from Vellore, the famous Arunachala Temple in Thiruvannaamalai is one of the greatest Shaiva temples in South India. Tiruvannamalai along with Gingee Fort is one of the ideal Chennai weekend getaways and a major pilgrimage site in Tamilnadu. Built within an area of 25 acres, this temple was constructed by Vijayanagara kings between 16th and the 17th centuries. This temple is famous for its huge & massive gopurams built on four sides of the temple. The Rajagopuram on East Gateway is 217 feet high with 11 storeys. The base measure 135 feet by 98 feet. This tower was built by King Krishna Devaraya of Vijayanagar. The Thousand Pillared Mantapam and the tank opposite to it were also constructed by Krishna Devaraya. The temple is fortified by a huge wall. Each of the prakarams has a huge Nandi. The KARTHIGAI DEEPAM FESTIVAL celebrated in Karthika Maasam is celebrated with glory. Sri Ramana Maharishi Ashramam is also located in Tiruvannamalai town."
    },
    {
      "id": 9,
      "templeName": "Subramanya Swami Temple",
      "location": "THIRUTTANI",
      "thumbnailPath": "images/Thiruttani10.jpg",
      "MainImagepath": "images/THIRUTTANI.jpg",
      "nearestBusStop": "Thiruthani  Bus Station (1 Kms)",
      "nearestRailwayStation": "Thiruthani Junction Railway Station",
      "nearestAirport": "Chennai - Menmbarkam Airport (86 Kms)",
      "description": "At a distance of 13 km from Arakkonam, 44 km from Kanchipuram, 86 km from Chennai and 65 km from Tirupati, Thiruthani is a holy town located in Tiruvallur District of Tamil Nadu and is famous for the Murugan Temple. This temple is one among the six Padai Veedus (Battle Grounds) of Lord Murugan, other five are Palani, Swamimalai, Tirupparangunram, Pazhamudircholai and Thiruchendur. This place represents the site where Subramanya stayed after destroying the demon Surapadman. Tiruttani is also said to be the place where the Lord Subramanya married Valli - one of his two consorts. This temple has been mentioned in the Sangam period work Tirumurugaatruppadai composed by Nakkeerar. According to legend, Devayani, daughter of Indra married Lord Murugan and was presented Indra's elephant Airavatam as part of his dowry offering. Upon Airavatam's departure Indra found his wealth waning. Lord Subramanya is said to have offered to return the white elephant, however Indra refused to accept a gift that he had made and instead requested that the elephant face his direction, hence the image of the elephant in this temple also faces the east. The hill temple is reachable by a motorable road and is also accessed through a plight of 365 steps. The temple has 4 enclosures and a series of temple towers. There is a shrine to Aapat Sahaaya Vinayakar who helped the Murugan in winning Valli's hand in marriage. The processional image of Murugan is housed in a Rudraksha tower. The large ornament adorning the image of Subramanya is decorated with green stones and is of great beauty. Lord Muruga is seen holding Vajra Hastam in his right hand instead of Vel, his regular weapon. There are separate shrines for Valli and Devayani. Sri Aadhi Balasubramanian graces on the wall behind the sanctum sanctorum as a child. Lord Bhairava graces in temple with 4 dogs vehicle representing 4 Vedas. The temple also has five ponds spread around the temple. The sandal paste used in worshipping the Lord on special festivals has a divine significance. It is believed to be gifted by Indra. Devotees dissolve in water and consume it as it is believed that would cure them from any disease. A large number of devotees flock to Thiruthani every year during the Aadi Krittikai festival. Other popular festivals at this temple are the Float Festival, Brahmotsavams, Valli Kalyanam, Skanda Sashti and Thai Pusam."
    }
  ]
}